Revit 2027 API
IFCParameterTemplate.IsExportingPropertySet Method
 Determines whether the provided property set is included in export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsExportingPropertySet(
	PropertySetupType propertySetupType,
	string propertySetName
)
Public Function IsExportingPropertySet (
	propertySetupType As PropertySetupType,
	propertySetName As String
) As Boolean
public:
bool IsExportingPropertySet(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
member IsExportingPropertySet :
        propertySetupType : PropertySetupType *
        propertySetName : string -> bool
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
Return Value
Boolean
 Whether or not the property set is included in export.
Exceptions
Exception | Condition
ArgumentException |  A property set with the given name is not present in the template.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace